#+TITLE:   AtomicInteger Performance Measurements
#+AUTHOR:  Foivos S. Zakkak
#+EMAIL:   foivos@zakkak.net
#+STARTUP: hidestars
#+STARTUP: showall

* AtomicInteger.compareAndSet with constant failures

  |-------------+----------------+-------------------------|
  |             | Atomic Manager | Readers Writers Locking |
  |-------------+----------------+-------------------------|
  | Single core | 885 ms         | 421 ms                  |
  |-------------+----------------+-------------------------|


* AtomicInteger.getAndIncrement

  Performs N getAndIncrement operations from X tasks on a single
  atomic integer.

** Readers Writers locking on FORMIC
   |-------+--------+--------+-----------------------+---------------|
   | Tasks | Boards |   Goal | Time (ms)             | clock cycles  |
   |-------+--------+--------+-----------------------+---------------|
   |     1 |      1 |    100 | 3325                  | 33,250,000    |
   |    64 |      8 |   6400 | 60728                 | 607,280,000   |
   |   503 |     64 |   5030 | 47612                 | 476,120,000   |
   |   503 |     64 |  50300 | 463529 (34033ms &1wa) | 4,635,297,296 |
   |   503 |     64 | 100600 | 931819 (72827ms &2wa) | 9,318,204,592 |
   |-------+--------+--------+-----------------------+---------------|

                            | Worker                                                      | Main |
   #+tblname: getandincrement
   |-------+--------+-------+-------------+--------+----------+--------+--------+----------+--------+---------|
   | Tasks | Boards |  Goal |        mean | median |       q1 |    min |    max |       q3 |  Total | Ops/sec |
   |-------+--------+-------+-------------+--------+----------+--------+--------+----------+--------+---------|
   |   503 |     64 |   503 |   1938.7852 |   1939 |      977 |     23 |   3860 |     2894 |   5447 |  259.44 |
   |   503 |     64 |  5030 |  40938.4373 |  41201 |  40237.5 |  31969 |  43096 |  42148.5 |  44686 |  122.87 |
   |   503 |     64 | 25150 | 217084.8330 | 217339 | 216374.5 | 208091 | 219254 | 218304.5 | 220861 |  115.85 |
   |   503 |     64 | 50300 | 434352.3598 | 434599 |   433654 | 425398 | 436502 | 435553.5 | 438099 |  115.80 |
   |-------+--------+-------+-------------+--------+----------+--------+--------+----------+--------+---------|
   #+TBLFM: $11=$3/($4/1000);%.2f

   #+begin_src gnuplot :var tgetandincrement=getandincrement :exports results :file getandincrement.pdf
     set title 'Atomic increment from 503 tasks'
     set xlabel "Number of operations"
     set ylabel "Total execution time (ms)"
     set style data linespoints
     set xtics rotate by -45
     plot tgetandincrement using 3:6:7:8:9 with candlesticks whiskerbars, \
          tgetandincrement using 3:5:5:5:5 with candlesticks lt -1 notitle
   #+end_src

   #+RESULTS:
   [[file:getandincrement.pdf]]

  A timer wrap-around (wa) is 4294967296 cc = ~429,496ms = ~7.158278827 min

** Readers Writers locking on Hydra
   |-------+-------+------+-----------+----------------|
   | Tasks | Cores | Goal | Time (ms) | clock cycles   |
   |-------+-------+------+-----------+----------------|
   |   503 |    64 | 5030 |      6666 | 13,998,600,000 |
   |    64 |    64 | 6400 |        72 | 151,200,000    |
   |-------+-------+------+-----------+----------------|

  A timer wrap-around (wa) is 4294967296 cc = ~429,496ms = ~7.158278827 min

* AtomicInteger.set

   #+tblname: set
   |-------+--------+-------+-----------+--------+---------+--------+--------+---------+---------|
   | Tasks | Boards |  Goal |      mean | median |      q1 |    min |    max |      q3 | Ops/sec |
   |-------+--------+-------+-----------+--------+---------+--------+--------+---------+---------|
   |   503 |     64 |   503 |   1901.24 |   1901 |   963.5 |     22 |   3781 |    2837 |  264.56 |
   |   503 |     64 |  5030 |  40723.84 |  40973 | 40031.5 |  31830 |  42863 | 41923.5 |  123.51 |
   |   503 |     64 | 25150 | 213603.93 | 213850 |  212908 | 204798 | 215745 |  214805 |  117.74 |
   |   503 |     64 | 50300 | 432604.72 | 432858 |  431907 | 423645 | 434757 |  433815 |  116.27 |
   |-------+--------+-------+-----------+--------+---------+--------+--------+---------+---------|
   #+TBLFM: $10=$3/($4/1000);%.2f

   #+begin_src gnuplot :var tset=set :exports results :file set.pdf
     set title 'Atomic write from 503 tasks'
     set xlabel "Number of operations"
     set ylabel "Total execution time (ms)"
     set style data linespoints
     set xtics rotate by -45
     plot tset using 3:6:7:8:9 with candlesticks whiskerbars, \
          tset using 3:5:5:5:5 with candlesticks lt -1 notitle
   #+end_src

   #+RESULTS:
   [[file:set.pdf]]

* AtomicInteger.get

   #+tblname: get
   |-------+--------+-------+---------+--------+------+------+------+--------+----------|
   | Tasks | Boards |  Goal |    mean | median |   q1 |  min |  max |     q3 |  Ops/sec |
   |-------+--------+-------+---------+--------+------+------+------+--------+----------|
   |   503 |     63 |   503 |   20.69 |     21 |   20 |   20 |   21 |     21 | 24311.26 |
   |   503 |     63 |  5030 |  186.16 |    186 |  186 |  186 |  187 |    186 | 27019.77 |
   |   503 |     63 | 25150 | 1554.47 |   1551 | 1515 | 1356 | 1702 |   1598 | 16179.15 |
   |   503 |     63 | 50300 | 3382.86 |   3375 | 3282 | 3134 | 3694 | 3474.5 | 14869.08 |
   |-------+--------+-------+---------+--------+------+------+------+--------+----------|
   #+TBLFM: $10=$3/($4/1000);%.2f

   #+begin_src gnuplot :var tget=get :exports results :file get.pdf
     set title 'Atomic read from 503 tasks'
     set xlabel "Number of operations"
     set ylabel "Total execution time (ms)"
     set style data linespoints
     set xtics rotate by -45
     plot tget using 3:6:7:8:9 notitle with candlesticks whiskerbars, \
          tget using 3:5:5:5:5 with candlesticks lt -1 notitle
   #+end_src

   #+RESULTS:
   [[file:get.pdf]]

* AtomicInteger.set and get 50-50

   #+tblname: setN
   |-------+--------+-------+-----------+----------+-----------+--------+--------+-----------+---------|
   | Tasks | Boards |   Ops |      mean |   median |        q1 |    min |    max |        q3 | Ops/sec |
   |-------+--------+-------+-----------+----------+-----------+--------+--------+-----------+---------|
   |   503 |     64 | 25200 | 216831.33 | 217077.5 | 216665.25 | 211997 | 217889 | 217490.75 |  116.22 |
   |-------+--------+-------+-----------+----------+-----------+--------+--------+-----------+---------|
   #+TBLFM: $10=$3/($4/1000);%.2f

   #+tblname: getN
   |-------+--------+-------+---------+--------+------+------+------+------+----------|
   | Tasks | Boards |   Ops |    mean | median |   q1 |  min |  max |   q3 |  Ops/sec |
   |-------+--------+-------+---------+--------+------+------+------+------+----------|
   |   503 |     64 | 25100 | 1840.78 |   1841 | 1840 | 1839 | 1843 | 1841 | 13635.52 |
   |-------+--------+-------+---------+--------+------+------+------+------+----------|
   #+TBLFM: $10=$3/($4/1000);%.2f
